Public Attributes | List of all members
API_PictureHandle Struct Reference
Unit and image conversion
Structure for picture conversion. More...
#include <APIdefs_Goodies.h>
 Public Attributes
API_PictureFormat  | storageFormat
storage format of the picture
GSHandle  | pictHdl
handle that contains the image in the specified format
Detailed Description
Structure for picture conversion.
Remarks
This structure is used as a parameter of the ACAPI_Conversion_ConvertPicture goody function to convert an image into a different format. See also ACAPI_Conversion_ConvertMimePicture if you want to specify the image format using MIME types.
Member Data Documentation
◆ pictHdl
 API_PictureHandle::pictHdl
handle that contains the image in the specified format
◆ storageFormat
 API_PictureHandle::storageFormat
storage format of the picture